vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN547_DFP.pdsc
    <condition id="component.els_pkc.aes.condition_id">
      <require condition="allOf.component.els_pkc.key, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.key, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_key"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.buffer.condition_id">
      <require condition="allOf.component.els_pkc.core, component.els_pkc.data_integrity, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.core, component.els_pkc.data_integrity, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_core"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_data_integrity"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.cipher.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.buffer, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_buffer"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.cipher_modes.condition_id">
      <require condition="allOf.component.els_pkc.cipher, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.cipher, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_cipher"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.common.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_memory"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.core.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.crc.condition_id">
      <require condition="allOf.component.els_pkc.core, component.els_pkc.data_integrity, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.data_integrity.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.doc.mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN547.internal_condition">
      <require condition="anyOf.device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.ecc.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.buffer, component.els_pkc.flow_protection, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.ecc_deterministic.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.els.condition_id">
      <require condition="allOf.component.els_pkc.aead_modes, component.els_pkc.cipher_modes, component.els_pkc.core, component.els_pkc.data_integrity, component.els_pkc.els_common, component.els_pkc.els_header_only, component.els_pkc.hash, component.els_pkc.key, component.els_pkc.mac_modes, component.els_pkc.session, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.aead_modes, component.els_pkc.cipher_modes, component.els_pkc.core, component.els_pkc.data_integrity, component.els_pkc.els_common, component.els_pkc.els_header_only, component.els_pkc.hash, component.els_pkc.key, component.els_pkc.mac_modes, component.els_pkc.session, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_aead_modes"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_cipher_modes"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_core"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_data_integrity"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_els_common"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_els_header_only"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_hash"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_key"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_mac_modes"/>
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.els_common.condition_id">
      <require condition="allOf.component.els_pkc.core, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.core, device=MCXN547.internal_condition">
      <require Cclass="MCXN547 els_pkc" Cgroup="els_pkc_core"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
