vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN547_DFP.pdsc
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyar8031.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phydp8384x.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phygpy215.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyksz8041.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyksz8081.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phylan8720a.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phylan8741.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8201.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8211f.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phytja1100.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phytja1120.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyvsc8541.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.phyyt8521.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.pwm_ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=MCXN547.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXN547.internal_condition">
      <require condition="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpuart, component.lpuart_adapter, device=MCXN547.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXN547, component.silicon_id_mcxn, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXN547, component.silicon_id_mcxn, driver.common.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXN547, component.silicon_id_mcxn.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXN547, component.silicon_id_mcxn.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXN547, component.silicon_id_mcxn.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN547, component.silicon_id_mcxn.internal_condition">
      <require condition="anyOf.device_id=MCXN547.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
