vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN547_DFP.pdsc
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.npx.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.otp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pdm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pdm_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.pdm, driver.edma4, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.pdm, driver.edma4, device=MCXN547.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pdm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.plu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.powerquad.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.puf_v3.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.qdc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mem_interface, driver.romapi_flashiap, driver.romapi_nboot, driver.runbootloader, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flashiap"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="runbootloader"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.romapi_flashiap.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.romapi, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.romapi_nboot.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.runbootloader.condition_id">
      <require condition="allOf.driver.common, driver.romapi, device=MCXN547.internal_condition"/>
    </condition>
