vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN547_DFP.pdsc
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.sai, driver.edma4, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.sai, driver.edma4, device=MCXN547.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_emvsim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_emvsim.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_emvsim, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_emvsim, device_id=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_emvsim"/>
      <require condition="device_id.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_gpio.condition_id">
      <require condition="allOf.driver.common, driver.smartcard_uart, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.smartcard_uart, device_id=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_uart"/>
      <require condition="device_id.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_phy_tda8035.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartcard_uart.condition_id">
      <require condition="allOf.driver.common, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartdma.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.smartdma_mcxn.condition_id">
      <require condition="allOf.anyOf=device_id=MCXN547, driver.smartdma.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXN547, driver.smartdma.internal_condition">
      <require condition="anyOf.device_id=MCXN547.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.syspm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.tdet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXN547.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXN547.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MCXN547.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MCXN547.internal_condition"/>
    </condition>
