vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN547_DFP.pdsc
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_flow_protection" Cversion="1.9.0" condition="component.els_pkc.flow_protection.condition_id">
      <description>Component els_pkc.flow_protection</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Common.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local.h" projectpath="component/els_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_glikey" Cversion="1.9.0" condition="component.els_pkc.glikey.condition_id">
      <description>Component glikey</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClGlikey/src/mcuxClGlikey.c" projectpath="component/els_pkc/src/comps/mcuxClGlikey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/mcuxClGlikey.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/mcuxClGlikey_SfrAccess.h" projectpath="component/els_pkc/src/comps/mcuxClGlikey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClGlikey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_hash" Cversion="1.9.0" condition="component.els_pkc.hash.condition_id">
      <description>Component els_pkc.hash</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_common.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_compute.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_oneshot_compute.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_Internal.c" projectpath="component/els_pkc/src/comps/mcuxClHash/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Types.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClHash/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHash/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_hashmodes" Cversion="1.9.0" condition="component.els_pkc.hashmodes.condition_id">
      <description>Component els_pkc.hashmodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Core_c_sha1.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Core_els_sha2.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_c_sha1.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_els_sha2.c" projectpath="component/els_pkc/src/comps/mcuxClHashModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Core_c_sha1.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Core_els_sha2.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_els_sha2.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClHashModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHashModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_hmac" Cversion="1.9.0" condition="component.els_pkc.hmac.condition_id">
      <description>Component els_pkc.hmac</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Els.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Functions.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Helper.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Sw.c" projectpath="component/els_pkc/src/comps/mcuxClHmac/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Core_Functions_Els.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Core_Functions_Sw.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClHmac/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHmac/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_key" Cversion="1.9.0" condition="component.els_pkc.key.condition_id">
      <description>Component els_pkc.key</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Protection.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_ProtectionMechanisms.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Types.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Functions_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Protection_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Types_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_key_derivation" Cversion="1.9.0" condition="component.els_pkc.key_derivation.condition_id">
      <description>Component els_pkc.key_derivation</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_agreement.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_agreement_selftest.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_HKDF.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_NIST_SP800_108.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_NIST_SP800_56C.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Derivation_PBKDF2.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_generate_keypair.c" projectpath="component/els_pkc/src/comps/mcuxClKey/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_HKDF.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_NIST_SP800_108.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_NIST_SP800_56C.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_DerivationAlgorithms_PBKDF2.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Derivation_Helper.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_DerivationAlgorithms_NIST_SP800_108_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClKey/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_mac" Cversion="1.9.0" condition="component.els_pkc.mac.condition_id">
      <description>Component els_pkc.mac</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMac/src/mcuxClMac.c" projectpath="component/els_pkc/src/comps/mcuxClMac/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMac/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMac/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN547 els_pkc" Cgroup="els_pkc_mac_modes" Cversion="1.9.0" condition="component.els_pkc.mac_modes.condition_id">
      <description>Component els_pkc.mac_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Common.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Common_Modes.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Cbcmac.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Cmac.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Els_Functions.c" projectpath="component/els_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Modes.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Algorithms.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Memory.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Wa.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Cbcmac.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Cmac.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Ctx.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Els_Types.h" projectpath="component/els_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMacModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClMacModes/inc/internal/"/>
      </files>
    </component>
